Table of Contents
 Class ConnectionPoint
Namespace
IdeaRS.OpenModel.Connection
Assembly
IdeaRS.OpenModel.dll
ConnectedDesignMemeber
[OpenModelClass("CI.StructModel.Structure.ConnectionPoint,CI.StructuralElements", "CI.StructModel.Structure.IConnectionPoint,CI.BasicTypes")]
public class ConnectionPoint : OpenElementId
Inheritance
object
OpenObject
OpenElementId
ConnectionPoint
Inherited Members
 OpenElementId.Id
 object.Equals(object)
 object.Equals(object, object)
 object.GetHashCode()
 object.GetType()
 object.MemberwiseClone()
 object.ReferenceEquals(object, object)
 object.ToString()
Constructors
 ConnectionPoint()
Constructor
public ConnectionPoint()
Properties
 BearingMember
Bearing Member
public ReferenceElement BearingMember { get; set; }
Property Value
ReferenceElement
 ConnectedMembers
Connected members as collection of IDs.
public List<ConnectedMember> ConnectedMembers { get; set; }
Property Value
List<ConnectedMember>
 Name
Name of Element
public string Name { get; set; }
Property Value
string
 Node
Node
public ReferenceElement Node { get; set; }
Property Value
ReferenceElement
 NodeId
Id of node
[Obsolete("Use the Node reference element.")]
public int NodeId { get; set; }
Property Value
int
Remarks
This property is not longer supported. Use the Node property instead of this one.
 NodeIdSerialize
Gets or sets the Id of node for Xml serialization (back compatibility).
public int NodeIdSerialize { get; set; }
Property Value
int
 ProjectFileName
Set filename for Connection
public string ProjectFileName { get; set; }
Property Value
string
 Edit this page